PeterSommerlad/ArduinoCore-avr/variants/mega/pins_arduino.h
	return (pin >=bitstart) && (pin < (bitstart +8));
}

template <uint8_t thebyte,PinType ...pins>
constexpr inline uint8_t bytebitmask(){
	constexpr uint8_t bitstart = thebyte * 8;
	return ( (static_cast<unsigned int>(isInByte<thebyte>(pins) << ((pins-bitstart) * isInByte<thebyte>(pins))))|...);
}

template <uint8_t thebyte,PinType ...pins>
constexpr inline bool isOneOfPinsInByte(uint8_t pin) noexcept {
	constexpr uint8_t bitstart = thebyte * 8;

	return isInByte<thebyte>(pin)&& ((1ul << pin-bitstart ) & bytebitmask<thebyte,pins...>());
}

template<uint8_t...allbytes>
struct isPinInBytesHelper {
	template <PinType ...pins>
	static constexpr inline bool isOneOfPins(uint8_t pin) noexcept {
		return ((isOneOfPinsInByte<allbytes,pins...>(pin)||...));
	}

};
}

template <PinType ...pins>
constexpr inline bool isOneOfPins(uint8_t pin) noexcept {
	return ((pin == pins)||...);

//	return detail::isPinInBytesHelper<0,1,2,3,4,5,6,7,8,9>::isOneOfPins<pins...>(pin); // maximum of 72 pins on Mega
}


constexpr inline PortType digital_pin_to_Port_PS(uint8_t const pin) noexcept {
	if (pin >= D22 && pin <= D29)
		return PortType::PA;
	if ((pin >= D10 && pin <= D13) || (pin >= D50 && pin <= D53))
		return PortType::PB;
	if (pin >= D30 && pin <= D37)
		return PortType::PC;
	if ((pin >= D18 && pin <= D21) || pin == D38)
		return PortType::PD;
	if (isOneOfPins<D00,D01,D02,D03,D05>(pin))
		return PortType::PE;
	if (pin >= D54 && pin <= D61)
		return PortType::PF;
	if (pin == D04 || (pin >= D39 && pin <= D41))
		return PortType::PG;
	if (isOneOfPins<D06,D07,D08,D09,D16,D17>(pin))
		return PortType::PH;
	if (pin == D14 || pin == D15)
		return PortType::PJ;
	if (pin >= D62 && pin <= D69)
		return PortType::PK;
	if (pin >= D42 && pin <= D49)
		return PortType::PL;
	return NO_PORT;
}
//constexpr inline PortType digital_pin_to_Port_PS(uint8_t pin) noexcept {
//	using PT=PinType;
//	switch(static_cast<PinType>(pin)){
//	case PT::D22: case PT::D23: case PT::D24: case PT::D25: case PT::D26: case PT::D27: case PT::D28: case PT::D29:
//		return PortType::PA;
//	case PT::D10: case PT::D11: case PT::D12: case PT::D13: case PT::D50: case PT::D51: case PT::D52: case PT::D53:
//		return PortType::PB;
//	case PT::D30: case PT::D31: case PT::D32: case PT::D33: case PT::D34: case PT::D35: case PT::D36: case PT::D37:
//		return PortType::PC;
//	case PT::D18: case PT::D19: case PT::D20: case PT::D21: case PT::D38:
//		return PortType::PD;
//	case PT::D00: case PT::D01: case PT::D02: case PT::D03:	case PT::D05:
//		return PortType::PE;
//	case PT::D54: case PT::D55: case PT::D56: case PT::D57: case PT::D58: case PT::D59: case PT::D60: case PT::D61:
//		return PortType::PF;
//	case PT::D04: case PT::D39: case PT::D40: case PT::D41:
//		return PortType::PG;
//	case PT::D06: case PT::D07: case PT::D08: case PT::D09: case PT::D16: case PT::D17:
//		return PortType::PH;
//	case PT::D14: case PT::D15:
//		return PortType::PJ;
//	case PT::D62: case PT::D63: case PT::D64: case PT::D65: case PT::D66: case PT::D67: case PT::D68: case PT::D69:
//		return PortType::PK;
//	case PT::D42: case PT::D43: case PT::D44: case PT::D45: case PT::D46: case PT::D47: case PT::D48: case PT::D49:
//		return PortType::PL;
//	}
//	return NO_PORT;
//}

#endif

#ifndef UsePetersCpp17
#ifdef ARDUINO_MAIN
const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
	// PIN IN PORT		
	// -------------------------------------------		
	_BV( 0 )	, // PE 0 ** 0 ** USART0_RX	
	_BV( 1 )	, // PE 1 ** 1 ** USART0_TX	
	_BV( 4 )	, // PE 4 ** 2 ** PWM2	
	_BV( 5 )	, // PE 5 ** 3 ** PWM3	
	_BV( 5 )	, // PG 5 ** 4 ** PWM4	
	_BV( 3 )	, // PE 3 ** 5 ** PWM5	
	_BV( 3 )	, // PH 3 ** 6 ** PWM6	
	_BV( 4 )	, // PH 4 ** 7 ** PWM7	
	_BV( 5 )	, // PH 5 ** 8 ** PWM8	
	_BV( 6 )	, // PH 6 ** 9 ** PWM9	
	_BV( 4 )	, // PB 4 ** 10 ** PWM10	
	_BV( 5 )	, // PB 5 ** 11 ** PWM11	
	_BV( 6 )	, // PB 6 ** 12 ** PWM12	
	_BV( 7 )	, // PB 7 ** 13 ** PWM13	
	_BV( 1 )	, // PJ 1 ** 14 ** USART3_TX	
	_BV( 0 )	, // PJ 0 ** 15 ** USART3_RX	
	_BV( 1 )	, // PH 1 ** 16 ** USART2_TX	
	_BV( 0 )	, // PH 0 ** 17 ** USART2_RX	
	_BV( 3 )	, // PD 3 ** 18 ** USART1_TX	
	_BV( 2 )	, // PD 2 ** 19 ** USART1_RX	
	_BV( 1 )	, // PD 1 ** 20 ** I2C_SDA	
	_BV( 0 )	, // PD 0 ** 21 ** I2C_SCL	
	_BV( 0 )	, // PA 0 ** 22 ** D22	
	_BV( 1 )	, // PA 1 ** 23 ** D23	
	_BV( 2 )	, // PA 2 ** 24 ** D24	
	_BV( 3 )	, // PA 3 ** 25 ** D25	
	_BV( 4 )	, // PA 4 ** 26 ** D26	
	_BV( 5 )	, // PA 5 ** 27 ** D27	
	_BV( 6 )	, // PA 6 ** 28 ** D28	
	_BV( 7 )	, // PA 7 ** 29 ** D29	
	_BV( 7 )	, // PC 7 ** 30 ** D30	
	_BV( 6 )	, // PC 6 ** 31 ** D31	
	_BV( 5 )	, // PC 5 ** 32 ** D32	
	_BV( 4 )	, // PC 4 ** 33 ** D33	
	_BV( 3 )	, // PC 3 ** 34 ** D34	
	_BV( 2 )	, // PC 2 ** 35 ** D35	
	_BV( 1 )	, // PC 1 ** 36 ** D36	
	_BV( 0 )	, // PC 0 ** 37 ** D37	
	_BV( 7 )	, // PD 7 ** 38 ** D38	
	_BV( 2 )	, // PG 2 ** 39 ** D39	
	_BV( 1 )	, // PG 1 ** 40 ** D40	
	_BV( 0 )	, // PG 0 ** 41 ** D41	
	_BV( 7 )	, // PL 7 ** 42 ** D42	
	_BV( 6 )	, // PL 6 ** 43 ** D43	
	_BV( 5 )	, // PL 5 ** 44 ** D44	
	_BV( 4 )	, // PL 4 ** 45 ** D45	
	_BV( 3 )	, // PL 3 ** 46 ** D46	
	_BV( 2 )	, // PL 2 ** 47 ** D47	
	_BV( 1 )	, // PL 1 ** 48 ** D48	
	_BV( 0 )	, // PL 0 ** 49 ** D49	
	_BV( 3 )	, // PB 3 ** 50 ** SPI_MISO	
	_BV( 2 )	, // PB 2 ** 51 ** SPI_MOSI	
	_BV( 1 )	, // PB 1 ** 52 ** SPI_SCK	
	_BV( 0 )	, // PB 0 ** 53 ** SPI_SS	
	_BV( 0 )	, // PF 0 ** 54 ** A0	
	_BV( 1 )	, // PF 1 ** 55 ** A1	
	_BV( 2 )	, // PF 2 ** 56 ** A2	
	_BV( 3 )	, // PF 3 ** 57 ** A3	
	_BV( 4 )	, // PF 4 ** 58 ** A4	
	_BV( 5 )	, // PF 5 ** 59 ** A5	
	_BV( 6 )	, // PF 6 ** 60 ** A6	
	_BV( 7 )	, // PF 7 ** 61 ** A7	
	_BV( 0 )	, // PK 0 ** 62 ** A8	
	_BV( 1 )	, // PK 1 ** 63 ** A9	
	_BV( 2 )	, // PK 2 ** 64 ** A10	
	_BV( 3 )	, // PK 3 ** 65 ** A11	
	_BV( 4 )	, // PK 4 ** 66 ** A12	
	_BV( 5 )	, // PK 5 ** 67 ** A13	
	_BV( 6 )	, // PK 6 ** 68 ** A14	
	_BV( 7 )	, // PK 7 ** 69 ** A15	
};
#endif
#else


struct bitmask {
enum  bitmask_in_byte:uint8_t {
	b0=1,b1=2,b2=4,b3=8,b4=16,b5=32,b6=64,b7=128
};
static constexpr inline uint8_t digital_pin_to_BitMask_PS(uint8_t const pin) noexcept {
	if( isOneOfPins<D00,D15,D17,D21,D22,D37,D41,D49,D53,D54,D62>(pin))
		return bitmask_in_byte::b0;
	if( isOneOfPins<D01, D14, D16, D20, D23, D36, D40, D48, D52, D55, D63>(pin))
		return bitmask_in_byte::b1;
	if( isOneOfPins<D19, D24,D35, D39, D47, D51, D56,D64>(pin))
		return bitmask_in_byte::b2;
	if( isOneOfPins<D05, D06, D18, D25, D34, D46, D50, D57, D65>(pin))
		return bitmask_in_byte::b3;
	if( isOneOfPins<D02, D07, D10, D26, D33, D45, D58, D66>(pin))
		return bitmask_in_byte::b4;
	if( isOneOfPins<D03, D04, D08, D11, D27, D32, D44, D59, D67>(pin))
		return bitmask_in_byte::b5;
	if( isOneOfPins<D09, D12, D28, D31, D43, D60, D68>(pin))
		return bitmask_in_byte::b6;
	if( isOneOfPins<D13, D29, D30, D38, D42, D61, D69>(pin))
		return bitmask_in_byte::b7;
	return 0; // 0 might break code, may be, but would be better indicator.

